In [1]:
import pandas as pd

data = {'county': ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3]}
df = pd.DataFrame(data)
df

       county  year  reports
0     Cochice  2012        4
1        Pima  2012       24
2  Santa Cruz  2013       31
3    Maricopa  2014        2
4        Yuma  2014        3

In [2]:
print(df.groupby('county'))

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x7fda187daba8>

In [6]:
data = {'col1':['a','a','b','c'],
        'col2':['d','e','f','g'],
        'col3':[1,2,3,4]}
data = pd.DataFrame(data)
data

  col1 col2  col3
0    a    d     1
1    a    e     2
2    b    f     3
3    c    g     4

In [11]:
df = pd.crosstab(data.col1, data.col2, values=data.col3, aggfunc=[abs])
df

      abs
col2    d    e    f    g
col1
a     1.0  2.0  NaN  NaN
b     NaN  NaN  3.0  NaN
c     NaN  NaN  NaN  4.0

In [12]:
df.fillna(0)

      abs
col2    d    e    f    g
col1
a     1.0  2.0  0.0  0.0
b     0.0  0.0  3.0  0.0
c     0.0  0.0  0.0  4.0

In [ ]:

    col1 col2 col3
    a 	d 	1
    a 	e 	2
    b 	f 	3
    c 	g 	4